#pragma once
#include<array>
#include<vector>
#include <stdexcept>
using namespace std;


class DES
{
public:
    DES();  // 构造函数default
    void generateSubKeys(const array<int, 64>&); // 生成子密钥并派发
    array<int, 64> encrypt(const array<int, 64>&);   // 加密
    array<int, 64> decrypt(const array<int, 64>&);   // 解密


private:
    array<int, 64> permutate_IP(const array<int, 64>&);	// 明文初始置换IP
    array<int, 64> permutate_IP_1(const array<int, 64>&);	// 明文逆初始置换IP_1;
    array<int, 64> feistelFunction(const array<int, 64>& ,int);  // 轮函数，共需调用16次

    // 以下为轮函数调用的子函数
    array<int, 32> getLeft_32(const array<int, 64>&);    // 获取左边32bit
    array<int, 32> getRight_32(const array<int, 64>&);   // 获取右边32bit
    array<int, 64> changeOrder(const array<int, 64>&);   // 交换左右32bit的顺序
    array<int, 64> combineLeftRight_32(const array<int, 32>&, const array<int, 32>&);  //  将左右各32bit拼接为64bit
    array<int, 48> expand_E(const array<int, 32>&);  // 扩展轮输入的右半部分R(32bit->48bit)
    array<int, 32> substitute_S(const array<int, 48>&); // S盒代换选择(48bit->32bit)
    array<int, 32> permute_P(const array<int, 32>&);   // 置换运算P
    array<int, 48> XOR_48(const array<int, 48>&, const array<int, 48>&);  // 48bit异或
    array<int, 32> XOR_32(const array<int, 32>&, const array<int, 32>&);  // 32bit异或
    
    // 以下为密钥产生调用的子函数
    array<int, 56> permutate_PC_1(const array<int, 64>&);   // 置换选择1(PC_1)
    array<int, 48> permutate_PC_2(const array<int, 56>&);   // 置换选择2(PC_2)
    array<int, 28> getLeft_28(const array<int, 56>&);    // 获取左边28bit
    array<int, 28> getRight_28(const array<int, 56>&);   // 获取右边28bit
    array<int, 56> combineLeftRight_28(const array<int, 28>&, const array<int, 28>&);  //  将左右各28bit拼接为56bit
    array<int, 28> leftShift(const array<int, 28>& ,int);    // 左循环移位


    // 每一个array元素代表1bit
	vector<array<int, 48>> subKeys;	// 16轮中的子密钥 每个48位

    // 初始置换表(IP)
    const array<int, 64> IP = {
        58, 50, 42, 34, 26, 18, 10,  2, 
        60, 52, 44, 36, 28, 20, 12,  4,
        62, 54, 46, 38, 30, 22, 14,  6, 
        64, 56, 48, 40, 32, 24, 16,  8,
        57, 49, 41, 33, 25, 17,  9,  1, 
        59, 51, 43, 35, 27, 19, 11,  3,
        61, 53, 45, 37, 29, 21, 13,  5, 
        63, 55, 47, 39, 31, 23, 15,  7
    };

    // 逆初始置换表(IP_1)
    const array<int, 64> IP_1 = {
        40,  8, 48, 16, 56, 24, 64, 32,
        39,  7, 47, 15, 55, 23, 63, 31,
        38,  6, 46, 14, 54, 22, 62, 30,
        37,  5, 45, 13, 53, 21, 61, 29,
        36,  4, 44, 12, 52, 20, 60, 28,
        35,  3, 43, 11, 51, 19, 59, 27,
        34,  2, 42, 10, 50, 18, 58, 26,
        33,  1, 41,  9, 49, 17, 57, 25
    };

    // 选择扩展运算表(E)
    const array<int, 48> E = {
        32,  1,  2,  3,  4,  5,
         4,  5,  6,  7,  8,  9,
         8,  9, 10, 11, 12, 13,
        12, 13, 14, 15, 16, 17,
        16, 17, 18, 19, 20, 21, 
        20, 21, 22, 23, 24, 25,
        24, 25, 26, 27, 28, 29, 
        28, 29, 30, 31, 32,  1
    };

    // 置换运算表(P)
    const array<int, 32> P = {
        16,  7, 20, 21,
        29, 12, 28, 17,
         1, 15, 23, 26,
         5, 18, 31, 10,
         2,  8, 24, 14, 
        32, 27,  3,  9,
        19, 13, 30,  6,
        22, 11,  4, 25
    };


    // 置换选择1表(PC-1)
    const array<int, 56> PC_1 = {
        57, 49, 41, 33, 25, 17,  9,
         1, 58, 50, 42, 34, 26, 18,
        10,  2, 59, 51, 43, 35, 27,
        19, 11,  3, 60, 52, 44, 36,
        63, 55, 47, 39, 31, 23, 15,
         7, 62, 54, 46, 38, 30, 22,
        14,  6, 61, 53, 45, 37, 29,
        21, 13,  5, 28, 20, 12,  4
    };

    // 置换选择1表(PC-2)
    const array<int, 48> PC_2 = {
        14, 17, 11, 24, 1,  5,
         3, 28, 15, 6, 21, 10,
        23, 19, 12, 4, 26,  8,
        16,  7, 27, 20, 13, 2, 
        41, 52, 31, 37, 47, 55,
        30, 40, 51, 45, 33, 48,
        44, 49, 39, 56, 34, 53,
        46, 42, 50, 36, 29, 32
    };

    // 左循环移位位数表
    const array<int, 16> LS = {
         1, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 1
    };


    // S1盒
    const array<array<int, 16>, 4> S1 = {
        14 ,  4 , 13 ,  1 ,  2 , 15 , 11 ,  8 ,  3 , 10 ,  6 , 12 ,  5 ,  9 ,  0 ,  7 ,
         0 , 15 ,  7 ,  4 , 14 ,  2 , 13 ,  1 , 10 ,  6 , 12 , 11 ,  9 ,  5 ,  3 ,  8 ,
         4 ,  1 , 14 ,  8 , 13 ,  6 ,  2 , 11 , 15 , 12 ,  9 ,  7 ,  3 , 10 ,  5 ,  0 ,
        15 , 12 ,  8 ,  2 ,  4 ,  9 ,  1 ,  7 ,  5 , 11 ,  3 , 14 , 10 ,  0 ,  6 , 13
    };

    // S2盒
    const array<array<int, 16>, 4> S2 = {
        15,  1,  8, 14,  6, 11,  3,  4,  9,  7,  2, 13, 12,  0,  5, 10,
         3, 13,  4,  7, 15,  2,  8, 14, 12,  0,  1, 10,  6,  9, 11,  5,
         0, 14,  7, 11, 10,  4, 13,  1,  5,  8, 12,  6,  9,  3,  2, 15,
        13,  8, 10,  1,  3, 15,  4,  2, 11,  6,  7, 12,  0,  5, 14,  9
    };

    // S3盒
    const array<array<int, 16>, 4> S3 = {
        10 ,  0 ,  9 , 14 ,  6 ,  3 , 15 ,  5 ,  1 , 13 , 12 ,  7 , 11 ,  4 ,  2 ,  8 ,
        13 ,  7 ,  0 ,  9 ,  3 ,  4 ,  6 , 10 ,  2 ,  8 ,  5 , 14 , 12 , 11 , 15 ,  1 ,
        13 ,  6 ,  4 ,  9 ,  8 , 15 ,  3 ,  0 , 11 ,  1 ,  2 , 12 ,  5 , 10 , 14 ,  7 ,
         1 , 10 , 13 ,  0 ,  6 ,  9 ,  8 ,  7 ,  4 , 15 , 14 ,  3 , 11 ,  5 ,  2 , 12
    };

    // S4盒
    const array<array<int, 16>, 4> S4 = {
         7 , 13 , 14 ,  3 ,  0 ,  6 ,  9 , 10 ,  1 ,  2 ,  8 ,  5 , 11 , 12 ,  4 , 15 ,
        13 ,  8 , 11 ,  5 ,  6 , 15 ,  0 ,  3 ,  4 ,  7 ,  2 , 12 ,  1 , 10 , 14 ,  9 ,
        10 ,  6 ,  9 ,  0 , 12 , 11 ,  7 , 13 , 15 ,  1 ,  3 , 14 ,  5 ,  2 ,  8 ,  4 ,
         3 , 15 ,  0 ,  6 , 10 ,  1 , 13 ,  8 ,  9 ,  4 ,  5 , 11 , 12 ,  7 ,  2 , 14
    };

    // S5盒
    const array<array<int, 16>, 4> S5 = {
         2 , 12 ,  4 ,  1 ,  7 , 10 , 11 ,  6 ,  8 ,  5 ,  3 , 15 , 13 ,  0 , 14 ,  9 ,
        14 , 11 ,  2 , 12 ,  4 ,  7 , 13 ,  1 ,  5 ,  0 , 15 , 10 ,  3 ,  9 ,  8 ,  6 ,
         4 ,  2 ,  1 , 11 , 10 , 13 ,  7 ,  8 , 15 ,  9 , 12 ,  5 ,  6 ,  3 ,  0 , 14 ,
        11 ,  8 , 12 ,  7 ,  1 , 14 ,  2 , 13 ,  6 , 15 ,  0 ,  9 , 10 ,  4 ,  5 ,  3
    };

    // S6盒
    const array<array<int, 16>, 4> S6 = {
        12 ,  1 , 10 , 15 ,  9 ,  2 ,  6 ,  8 ,  0 , 13 ,  3 ,  4 , 14 ,  7 ,  5 , 11 ,
        10 , 15 ,  4 ,  2 ,  7 , 12 ,  9 ,  5 ,  6 ,  1 , 13 , 14 ,  0 , 11 ,  3 ,  8 ,
         9 , 14 , 15 ,  5 ,  2 ,  8 , 12 ,  3 ,  7 ,  0 ,  4 , 10 ,  1 , 13 , 11 ,  6 ,
         4 ,  3 ,  2 , 12 ,  9 ,  5 , 15 , 10 , 11 , 14 ,  1 ,  7 ,  6 ,  0 ,  8 , 13
    };

    // S7盒
    const array<array<int, 16>, 4> S7 = {
         4 , 11 ,  2 , 14 , 15 ,  0 ,  8 , 13 ,  3 , 12 ,  9 ,  7 ,  5 , 10 ,  6 ,  1 ,
        13 ,  0 , 11 ,  7 ,  4 ,  9 ,  1 , 10 , 14 ,  3 ,  5 , 12 ,  2 , 15 ,  8 ,  6 ,
         1 ,  4 , 11 , 13 , 12 ,  3 ,  7 , 14 , 10 , 15 ,  6 ,  8 ,  0 ,  5 ,  9 ,  2 ,
         6 , 11 , 13 ,  8 ,  1 ,  4 , 10 ,  7 ,  9 ,  5 ,  0 , 15 , 14 ,  2 ,  3 , 12
    };

    // S8盒
    const array<array<int, 16>, 4> S8 = {
        13 ,  2 ,  8 ,  4 ,  6 , 15 , 11 ,  1 , 10 ,  9 ,  3 , 14 ,  5 ,  0 , 12 ,  7 ,
         1 , 15 , 13 ,  8 , 10 ,  3 ,  7 ,  4 , 12 ,  5 ,  6 , 11 ,  0 , 14 ,  9 ,  2 ,
         7 , 11 ,  4 ,  1 ,  9 , 12 , 14 ,  2 ,  0 ,  6 , 10 , 13 , 15 ,  3 ,  5 ,  8 ,
         2 ,  1 , 14 ,  7 ,  4 , 10 ,  8 , 13 , 15 , 12 ,  9 ,  0 ,  3 ,  5 ,  6 , 11
    };

    // 代换/选择表(S盒，S1-8)
    const vector<array<array<int, 16>, 4>> S = {
        S1, S2, S3, S4, S5, S6, S7, S8
    };
};
